2. Code with Numpy Package

In [1]:
import pandas as pd
import numpy as np

ser = pd.Series()
print("Pandas Series: ",ser)

data = np.array(['V','e','n','k','y'])

ser = pd.Series(data)
print("Pnada Series: ",ser)

Pandas Series:  Series([], dtype: object)
Pnada Series:  0    V
1    e
2    n
3    k
4    y
dtype: object

In [4]:
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
import pandas as pd
lst = ['Amrita','Vishwa ','Vidyapeetham','Computer science']
print(lst)

['Amrita', 'Vishwa ', 'Vidyapeetham', 'Computer science']

In [5]:
df = pd.DataFrame(lst)
print(df)

                  0
0            Amrita
1           Vishwa
2      Vidyapeetham
3  Computer science

In [7]:
data = {'Name':['Venky','Danda','Kalyan','Ganesh'],'Age':['20','19','18','20']}
df = pd.DataFrame(data)
print(df)

     Name Age
0   Venky  20
1   Danda  19
2  Kalyan  18
3  Ganesh  20

In [9]:
print(df[['Name']])

     Name
0   Venky
1   Danda
2  Kalyan
3  Ganesh

In [16]:
import pandas as pd
data = pd.read_csv("F:/FOUNDATIONS OF DATA SCIENCE/nba.csv", index_col="Name")


first = data.loc["Avery Bradley"]
second = data.loc["R.J. Hunter"]

print(first,"\n\n\n",second)

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object


 Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

In [19]:
import pandas as pd
age_list = [['Afghanistan', 1952, 8425333, 'Asia'],
			['Australia', 1957, 9712569, 'Oceania'],
			['Brazil', 1962, 76039390, 'Americas'],
			['China', 1957, 637408000, 'Asia'],
			['France', 1957, 44310863, 'Europe'],
			['India', 1952, 3.72e+08, 'Asia'],
			['United States', 1957, 171984000, 'Americas']]
df = pd.DataFrame(age_list,columns=['Country','Year','Population','Continent'])
df

         Country  Year   Population Continent
0    Afghanistan  1952    8425333.0      Asia
1      Australia  1957    9712569.0   Oceania
2         Brazil  1962   76039390.0  Americas
3          China  1957  637408000.0      Asia
4         France  1957   44310863.0    Europe
5          India  1952  372000000.0      Asia
6  United States  1957  171984000.0  Americas

In [23]:
df.sort_values(by=['Population'] , ascending=False)

         Country  Year   Population Continent
3          China  1957  637408000.0      Asia
5          India  1952  372000000.0      Asia
6  United States  1957  171984000.0  Americas
2         Brazil  1962   76039390.0  Americas
4         France  1957   44310863.0    Europe
1      Australia  1957    9712569.0   Oceania
0    Afghanistan  1952    8425333.0      Asia

In [24]:
df.sort_values(by=['Population'],na_position='first')

         Country  Year   Population Continent
0    Afghanistan  1952    8425333.0      Asia
1      Australia  1957    9712569.0   Oceania
4         France  1957   44310863.0    Europe
2         Brazil  1962   76039390.0  Americas
6  United States  1957  171984000.0  Americas
5          India  1952  372000000.0      Asia
3          China  1957  637408000.0      Asia

In [25]:
df.sort_values(by=['Country','Continent'])

         Country  Year   Population Continent
0    Afghanistan  1952    8425333.0      Asia
1      Australia  1957    9712569.0   Oceania
2         Brazil  1962   76039390.0  Americas
3          China  1957  637408000.0      Asia
4         France  1957   44310863.0    Europe
5          India  1952  372000000.0      Asia
6  United States  1957  171984000.0  Americas

In [26]:
import pandas as pd
import numpy as np
dict = {'First Score':[100, 90, np.nan, 95],
		'Second Score': [30, 45, 56, np.nan],
		'Third Score':[np.nan, 40, 80, 98]}
df = pd.DataFrame(dict)
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [13]:
import pandas as pd

# Creating a DataFrame with some missing (NaN) values
data = {'Name':['Venky','Danda','Kalyan','Ganesh'],
        'Age': [20, None, 30, None],
        'City': ['Tirupati', 'Narasaraopeta', None, 'Kadapa']}

df = pd.DataFrame(data)
print("Original DataFrame:\n", df)
df.isnull()

Original DataFrame:
      Name   Age           City
0   Venky  20.0       Tirupati
1   Danda   NaN  Narasaraopeta
2  Kalyan  30.0           None
3  Ganesh   NaN         Kadapa

    Name    Age   City
0  False  False  False
1  False   True  False
2  False  False   True
3  False   True  False

In [15]:
df.notnull()

   Name    Age   City
0  True   True   True
1  True  False   True
2  True   True  False
3  True  False   True

In [17]:
df.fillna(10)

     Name   Age           City
0   Venky  20.0       Tirupati
1   Danda  10.0  Narasaraopeta
2  Kalyan  30.0             10
3  Ganesh  10.0         Kadapa

In [19]:
df.head()

     Name   Age           City
0   Venky  20.0       Tirupati
1   Danda   NaN  Narasaraopeta
2  Kalyan  30.0           None
3  Ganesh   NaN         Kadapa

In [21]:
df.describe()

             Age
count   2.000000
mean   25.000000
std     7.071068
min    20.000000
25%    22.500000
50%    25.000000
75%    27.500000
max    30.000000

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     2 non-null      float64
 2   City    3 non-null      object
dtypes: float64(1), object(2)
memory usage: 228.0+ bytes

In [25]:
df.shape

(4, 3)